{
    "1984": "A haunting dystopian novel set in a world dominated by a totalitarian regime where the government watches every move through surveillance and suppresses all independent thought. Winston Smith, a low-ranking member of the ruling Party, secretly rebels against the oppressive system in pursuit of truth and individual freedom. His forbidden romance with Julia gives him hope, but their rebellion is ultimately crushed, revealing the terrifying power of indoctrination and control over the human spirit.",
    "The Hobbit": "Bilbo Baggins, a reserved and comfort-loving hobbit, is unexpectedly swept into a grand adventure with thirteen dwarves and the wizard Gandalf. Tasked with reclaiming the dwarves' homeland and treasure from the fearsome dragon Smaug, Bilbo faces trolls, goblins, giant spiders, and other perils. Along the journey, he discovers inner bravery, quick thinking, and the value of friendship, transforming from a reluctant traveler into a clever and courageous hero.",
    "Harry Potter and the Sorcerer’s Stone": "Young orphan Harry Potter discovers on his eleventh birthday that he is a wizard and has been accepted to the magical Hogwarts School. At Hogwarts, he makes loyal friends and uncovers the mystery of the Sorcerer's Stone while learning about his parents' legacy and the dark wizard Voldemort who killed them. Through trials and discoveries, Harry begins his journey of self-discovery, marked by friendship, bravery, and the looming shadow of evil.",
  
    "The Little Prince": "Told through the eyes of a stranded aviator, this poetic tale follows a young prince who travels from planet to planet, meeting strange adult characters who reflect different human flaws. On Earth, he befriends a fox who teaches him the meaning of love, connection, and seeing with the heart rather than the eyes. The story explores themes of innocence, imagination, and the importance of the invisible and the essential in life.",
    "To Kill a Mockingbird": "Set in the racially segregated American South during the 1930s, the story follows young Scout Finch as she comes of age under the guidance of her principled father, Atticus Finch. As Atticus defends a Black man wrongly accused of raping a white woman, Scout and her brother Jem witness the harsh realities of racism, injustice, and moral courage. Through their experiences, they learn deep lessons about empathy, integrity, and human dignity.",

    "The Chronicles of Narnia: The Lion, the Witch, and the Wardrobe": "During World War II, four siblings are sent to the countryside and discover a magical wardrobe that leads to the land of Narnia—frozen in eternal winter under the rule of the White Witch. As they join the noble lion Aslan in a battle to free Narnia, they undergo personal growth, face betrayal and redemption, and ultimately fulfill an ancient prophecy. The story blends epic fantasy with profound themes of sacrifice, bravery, and hope.",
  
    "The Catcher in the Rye": "Holden Caulfield, a disaffected teenage boy recently expelled from prep school, wanders through New York City while grappling with feelings of alienation, grief, and confusion. Through his inner monologue, he critiques the 'phony' nature of the adult world while yearning for sincerity and meaningful human connection. His journey exposes the painful transition from adolescence to adulthood and highlights the emotional turbulence that comes with it.",
  
    "The Great Gatsby": "Set in the glittering world of 1920s Long Island, the novel follows Jay Gatsby, a mysterious millionaire who throws lavish parties in hopes of reuniting with Daisy Buchanan, the love of his life. Narrated by Nick Carraway, the story delves into themes of illusion, desire, and the corrupting influence of wealth. Gatsby's tragic pursuit of the American Dream reveals the emptiness of materialism and the unattainability of idealized love.",
  
    "The Lord of the Rings: The Fellowship of the Ring": "Frodo Baggins, a young hobbit from the peaceful Shire, inherits a powerful and dangerous ring that must be destroyed to save Middle-earth from the dark lord Sauron. He forms the Fellowship—a group of allies including humans, elves, dwarves, and other hobbits—to undertake this perilous quest. The novel sets the stage for an epic saga about friendship, self-sacrifice, and the enduring struggle between good and evil.",
  
    "Anne of Green Gables": "Anne Shirley, an imaginative and spirited orphan, is mistakenly sent to live with the elderly siblings Marilla and Matthew Cuthbert in rural Prince Edward Island. Though initially unwanted, Anne wins over the townspeople with her intelligence, creativity, and kind heart. Her adventures, missteps, and triumphs paint a heartwarming picture of belonging, growth, and the power of positivity and imagination.",
  
    "Alice’s Adventures in Wonderland": "Young Alice falls down a rabbit hole into a fantastical world where logic is turned upside-down and strange creatures abound. She encounters whimsical characters like the Mad Hatter, Cheshire Cat, and Queen of Hearts while navigating a dreamlike landscape full of puzzling rules and riddles. The story is a celebration of curiosity, imagination, and the questioning of authority and convention.",
  
    "Treasure Island": "Jim Hawkins, a young boy, discovers a pirate’s treasure map and sets off on a high-seas adventure. The voyage introduces him to memorable characters like Long John Silver, a charismatic yet duplicitous pirate. Jim’s journey is filled with danger, betrayal, and bravery, serving as a thrilling coming-of-age story about moral choices and the transition into adulthood.",
  
    "Charlotte’s Web": "Wilbur, a runt pig, is saved from slaughter by Charlotte, a wise and kind spider who spins words into her web to promote his worth. Their unlikely friendship touches the lives of those around them and reveals deep truths about loyalty, selflessness, and the natural cycle of life and death. This tender story is both a celebration of life and a gentle meditation on mortality and legacy.",
  
    "The Alchemist": "Santiago, a young Andalusian shepherd, dreams of finding a hidden treasure near the Egyptian pyramids. As he journeys through deserts, markets, and spiritual encounters, he learns that the true treasure lies in following one’s personal legend and listening to one’s heart. The novel blends mysticism, philosophy, and adventure into a powerful allegory about destiny, perseverance, and self-discovery.",
  
    "The Secret Garden": "Mary Lennox, a sour and spoiled girl, is sent to live in her uncle’s moorland estate after the death of her parents. There she discovers a neglected garden and gradually brings it back to life, forging friendships and healing emotionally along the way. The story is a touching narrative of renewal, personal growth, and the restorative power of nature and human connection.",
  
    "Moby-Dick": "Captain Ahab, obsessed with hunting the elusive white whale Moby Dick, leads his crew on a dangerous and fateful voyage. Narrated by Ishmael, the novel is a deep exploration of obsession, revenge, fate, and the struggle between man and nature. Through philosophical digressions and epic encounters, the book becomes both a maritime adventure and a profound reflection on the human condition.",
  
    "Frankenstein": "Victor Frankenstein, a passionate scientist, creates a living being from dead matter, only to recoil in horror at the creature he brought to life. Rejected by society, the intelligent and sensitive creature seeks acceptance but is met with fear and hatred, leading to vengeance and tragedy. The novel raises complex questions about ambition, responsibility, and the consequences of playing God with science.",
  
    "Don Quixote": "An aging nobleman, obsessed with tales of chivalry, dons armor and sets off as the self-proclaimed knight Don Quixote. Accompanied by his loyal squire Sancho Panza, he embarks on absurd and noble adventures, mistaking windmills for giants and inns for castles. Cervantes crafts a humorous yet profound tale that satirizes idealism while celebrating imagination and unwavering faith in noble causes.",
  
    "Peter Pan": "Peter Pan, the boy who never grows up, whisks Wendy and her brothers away to the magical island of Neverland. There, they encounter pirates, fairies, and lost boys in a whirlwind of adventures. While the story delights in fantasy and childhood wonder, it also touches on themes of loss, memory, and the inevitability of growing up.",
  
    "Journey to the Center of the Earth": "Professor Lidenbrock, his nephew Axel, and their guide Hans undertake a daring expedition into an Icelandic volcano that leads them to the Earth's core. Along the way, they encounter prehistoric creatures, underground seas, and breathtaking phenomena. The novel combines science, imagination, and adventure, serving as a thrilling voyage into the unknown and a celebration of curiosity and discovery."
}
